#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.azurerm_dns_zone.default: Reading...
data.azurerm_kubernetes_cluster.aks: Reading...
data.azurerm_dns_zone.default: Read complete after 0s [id=/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-dns-zone-rg/providers/Microsoft.Network/dnsZones/efit-web.site]
data.azurerm_kubernetes_cluster.aks: Read complete after 1s [id=/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-aks-rg/providers/Microsoft.ContainerService/managedClusters/efit-aks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_dns_a_record.default will be created
  + resource "azurerm_dns_a_record" "default" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + resource_group_name = "efit-dns-zone-rg"
      + target_resource_id  = (known after apply)
      + ttl                 = 3600
      + zone_name           = "efit-web.site"
    }

  # azurerm_public_ip.lb-pip will be created
  + resource "azurerm_public_ip" "lb-pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "efit-web-prod-pip"
      + resource_group_name     = "efit-web-prod-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_resource_group.default will be created
  + resource "azurerm_resource_group" "default" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "efit-web-prod-rg"
      + tags     = {
          + "type" = "webapp"
        }
    }

  # azurerm_role_assignment.aks_network_contributor will be created
  + resource "azurerm_role_assignment" "aks_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "74364ded-c12f-4a49-b3de-b44c23227ec0"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @Jabronious, Action: `pull_request`*